Tekla Open API Reference for Tekla Structures 2025
WeldMark.WeldMarkAttributes Class
 The WeldMarkAttributes class is the attributes class for the weld mark attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.WeldMark.WeldMarkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class WeldMarkAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class WeldMarkAttributes
	Inherits AttributesBase
The WeldMark.WeldMarkAttributes type exposes the following members.
Constructors
Name | Description
WeldMark.WeldMarkAttributes()
 Creates a new default weld mark attributes instance that loads standard attributes.
WeldMark.WeldMarkAttributes(String)
 Creates a new weld mark attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
Font
 The weld mark font settings.
SeamAbove
 The visibility of the seam above parameters.
SeamBelow
 The visibility of the seam below parameters.
ShowEdgeAround
 Gets or sets visibility of the weld mark edge/around property.
ShowReferenceText
 Gets or sets visibility of the weld mark reference text.
ShowWeldNumber
 The visibility of the weld number.
ShowWorkshopSite
 Gets or sets visibility of the weld mark workshop/site property.
TransparentBackground
 Controls the text background transparency (transparent/opaque).
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace